KNbudjInf = 182.80
KNContInf = 158.29

KNbudjInformation = 181.70
KNContKNbudjInformation = 156.33

KNbudjIE = 189.46
KNContIE = 164.61

KNbudjKn = 188.06
KNContKn = 157.16

AboutKnFirst_engl = f'''✨122 Computer Science✨
Here are the results 👇
--------------------------------------------------------
Educational programme: Computer science 👇 

Your score — '''

AboutKnFirst = f'''✨122 Комп’ютерні науки✨
Тримай результати 👇
--------------------------------------------------------
Освітня програма: Інформатика 👇 

Ваш бал — '''

AboutKnSecond_engl = f'''It will be the same for all study programmes ❗️

The average EIT score for the budget in 2022 is {KNbudjInf}
The average EIT score for a contract in 2022 is {KNContInf}
--------------------------------------------------------
Educational programme: Management Information Technology 👇

Average EIT score for the budget in 2022 - {KNbudjInformation}
The average EIT score for the contract in 2022 is {KNContKNbudjInformation}
--------------------------------------------------------
Educational programme: Artificial Intelligence 👇

The average EIT score for the budget in 2022 is {KNbudjIE}
The average EIT score for the contract in 2022 is {KNContIE}
--------------------------------------------------------
Educational programme: Computer Science and Technology 👇

The average EIT score for the budget in 2022 is {KNbudjKn}
The average EIT score for the contract in 2022 is {KNContKn}
'''

AboutKnSecond = f'''Він буде однаковий для всіх освітніх програм ❗️

Середній бал ЗНО на бюджет у 2022 році — {KNbudjInf}
Середній бал ЗНО на контракт у 2022 році — {KNContInf}
--------------------------------------------------------
Освітня програма: Інформаційні технології управління 👇

Середній бал ЗНО на бюджет у 2022 році — {KNbudjInformation}
Середній бал ЗНО на контракт у 2022 році — {KNContKNbudjInformation}
--------------------------------------------------------
Освітня програма: Штучний інтелект 👇

Середній бал ЗНО на бюджет у 2022 році — {KNbudjIE}
Середній бал ЗНО на контракт у 2022 році — {KNContIE}
--------------------------------------------------------
Освітня програма: Комп`ютерні науки та технології 👇

Середній бал ЗНО на бюджет у 2022 році — {KNbudjKn}
Середній бал ЗНО на контракт у 2022 році — {KNContKn}
'''


AboutIngFistPart_engl = '''
✨123 Computer engineering✨
Keep the results 👇

<i>Your score is №1 - priority 1
Your score is №2 - priority 2</i>

Average EIT score for the state budget in 2022: <i>177.43</i>
Average EIT score for a contract in 2022: <i>152.92</i>

<i>Your score №1</i> —'''

AboutIngFistPart = '''
✨123 Комп’ютерна інженерія✨
Тримай результати 👇

<i>Ваш бал №1 — 1 пріорітет
Ваш бал №2 — 2 пріорітет</i>

Середній бал ЗНО на бюджет у 2022 році: <i>177.43</i>
Середній бал ЗНО на контракт у 2022 році: <i>152.92</i>

<i>Ваш бал №1</i> —'''


AboutIngSecondPart_engl = '''
<i>Your score is №2</i> —'''

AboutIngSecondPart = '''
<i>Ваш бал №2</i> —'''


AboutSysFist_engl = '''
✨124 System analysis✨
Get the results 👇

<i>Your score №1 - 1 priority
Your score №2 - 2nd priority</i>

Average EIT score for the state budget in 2022: <i>176.16</i>
Average EIT score for a contract in 2022: <i>147.42</i>

<i>Your score is №1</i> —'''

AboutSysFist = '''
✨124 Системний аналіз✨
Тримай результати 👇

<i>Ваш бал №1 — 1 пріорітет
Ваш бал №2 — 2 пріорітет</i>

Середній бал ЗНО на бюджет у 2022 році: <i>176.16</i>
Середній бал ЗНО на контракт у 2022 році: <i>147.42</i>

<i>Ваш бал №1</i> —'''


AboutSysSecond_engl = '''
<i>Your score is №2</i> —'''

AboutSysSecond = '''
<i>Ваш бал №2</i> —'''


AboutCybFirst_engl = '''
✨125 Cybersecurity✨
Here are the results 👇
--------------------------------------------------------
<i>Your score is №1 - priority 1
Your score is №2 - priority 2</i>
'''

AboutCybFirst = '''
✨125 Кібербезпека✨
Тримай результати 👇
--------------------------------------------------------
<i>Ваш бал №1 — 1 пріорітет 
Ваш бал №2 — 2 пріорітет</i>
'''


AboutCybBallFirst_engl = '''
Your score is №1 — '''
AboutCybBallFirst = '''
Ваш бал №1 — '''

AboutCybBallSecond_engl = '''
Your score is №2 — '''
AboutCybBallSecond = '''
Ваш бал №2 — '''

AboutCybSecond_engl = f'''

It will be the same for all educational programmes ❗️
--------------------------------------------------------
Educational programme: Security of information and communication systems 👇

Average EIT score for the state budget in 2022 — <i>177.08</i>
Average EIT score for a contract in 2022 — <i>143.58</i>
--------------------------------------------------------
Educational programme: Technical information security systems 👇

Average EIT score for the state budget in 2022 — <i>175.13</i>
Average EIT score for a contract in 2022 — <i>150.41</i>
--------------------------------------------------------
Educational program: Information security management 👇

Average EIT score for the state budget in 2022 — <i>178.79</i>
Average EIT score for a contract in 2022 — <i>147.40</i>
'''

AboutCybSecond = f'''

Він буде однаковий для всіх освітніх програм ❗️
--------------------------------------------------------
Освітня програма: Безпека інформаційних і комунікаційних систем 👇 

Середній бал ЗНО на бюджет у 2022 році — <i>177.08</i>
Середній бал ЗНО на контракт у 2022 році — <i>143.58</i>
--------------------------------------------------------
Освітня програма: Системи технічного захисту інформації 👇

Середній бал ЗНО на бюджет у 2022 році — <i>175.13</i>
Середній бал ЗНО на контракт у 2022 році — <i>150.41</i>
--------------------------------------------------------
Освітня програма: Управління інформаційною безпекою 👇

Середній бал ЗНО на бюджет у 2022 році — <i>178.79</i>
Середній бал ЗНО на контракт у 2022 році — <i>147.40</i>
'''


AboutInfSystemFirst_engl = '''
✨126 Information systems and technologies✨
Here are the results 👇
--------------------------------------------------------
<i>Your score is №1 - priority 1
Your score is №2 - priority 2</i>
'''

AboutInfSystemFirst = '''
✨126 Інформаційні системи та технології✨
Тримай результати 👇
--------------------------------------------------------
<i>Ваш бал №1 — 1 пріорітет 
Ваш бал №2 — 2 пріорітет</i>
'''


AboutInfSystemBallFist_engl = '''
Your score №1 is — '''
AboutInfSystemBallFist = '''
Ваш бал №1 — '''

AboutInfSystemBallSecond_engl = '''
Your score №2 is — '''
AboutInfSystemBallSecond = '''
Ваш бал №2 — '''


AboutInfSystemSecond_engl = '''

It will be the same for all educational programmes ❗️
--------------------------------------------------------
Educational programme: Information technologies of the Internet of Things 👇 

Average EIT score for the state budget in 2022: <i>175.33</i>
Average EIT score for a contract in 2022: <i>140.10</i>
--------------------------------------------------------
Educational programme: Information systems and technologies 👇

Average EIT score for the state budget in 2022: <i>175.33</i>
Average EIT score for a contract in 2022: <i>140.10</i>
--------------------------------------------------------
'''

AboutInfSystemSecond = '''

Він буде однаковий для всіх освітніх програм ❗️
--------------------------------------------------------
Освітня програма: Інформаційні технології інтернету речей 👇 

Середній балЗНО на бюджет у 2022 році: <i>175.33</i>
Середній балЗНО на контракт у 2022 році: <i>140.10</i>
--------------------------------------------------------
Освітня програма: Інформаційні системи та технології 👇

Середній бал ЗНО на бюджет у 2022 році: <i>175.33</i>
Середній бал ЗНО на контракт у 2022 році: <i>140.10</i>
--------------------------------------------------------
'''


AboutBioFirst_engl = '''
✨163 Biomedical engineering✨
Here are the results 👇

<i>Your score is №1 - priority 1
Your score is №2 - priority 2</i>

Average EIT score for the state budget in 2022: <i>185.44</i>
Average EIT score for a contract in 2022: <i>137.59</i>

<i>Your score is №1</i> —'''

AboutBioFirst = '''
✨163 Біомедична інженерія✨
Тримай результати 👇

<i>Ваш бал №1 — 1 пріорітет
Ваш бал №2 — 2 пріорітет</i>

Середній бал ЗНО на бюджет у 2022 році: <i>185.44</i>
Середній бал ЗНО на контракт у 2022 році: <i>137.59</i>

<i>Ваш бал №1</i> —'''


AboutBioSecond_engl = '''
<i>Ваш бал №2</i> —'''
AboutBioSecond = '''
<i>Your score is №2</i> —'''


AboutBioInform_engl = '''
🛑 You have not entered a score in Biology!
To calculate the score for this speciality, you must enter the scores for the following subjects 👇
🔸 Ukrainian language (Required)
🔸 Biology (Required)
🔸 Subject of your choice
'''

AboutBioInform = '''
🛑 Ви не ввели бал з біології!
Для розрахунку бала з цієї спеціальності ви повинні ввести бали з наступних предметів 👇
🔸 Українська мова (Обов'яз.)
🔸 Біологія (Обов'яз.)
🔸 Предмет на вибір
'''


AboutElectronikFirst_engl = '''
✨171 Electronics✨
Here are the results 👇
--------------------------------------------------------
<i>Your score is №1 - priority 1
Your score is №2 - priority 2</i>
'''

AboutElectronikFirst = '''
✨171 Електроніка✨
Тримай результати 👇
--------------------------------------------------------
<i>Ваш бал №1 — 1 пріорітет 
Ваш бал №2 — 2 пріорітет</i>
'''


AboutElectronikFirstBall_engl = '''
Your score is №1 — '''
AboutElectronikFirstBall = '''
Ваш бал №1 — '''

AboutElectronikSecondBall_engl = '''
Your score is №2 — '''
AboutElectronikSecondBall = '''
Ваш бал №2 — '''


AboutElectronikSecond_engl = '''

It will be the same for all educational programmes ❗️
--------------------------------------------------------
Educational programme: Electronic devices and systems 👇 

Average EIT score for the state budget in 2022: <i>166.59</i>
Average EIT score for a contract in 2022: <i>136.44</i>
--------------------------------------------------------
Educational programme: Systems, technologies and computer multimedia tools 👇

Average EIT score for the state budget in 2022: <i>172.23</i>
Average EIT score for a contract in 2022: <i>147.90</i>
--------------------------------------------------------
'''

AboutElectronikSecond = '''

Він буде однаковий для всіх освітніх програм ❗️
--------------------------------------------------------
Освітня програма: Електронні пристрої та системи 👇 

Середній бал ЗНО на бюджет у 2022 році: <i>166.59</i>
Середній бал ЗНО на контракт у 2022 році: <i>136.44</i>
--------------------------------------------------------
Освітня програма: Системи, технології і комп'ютерні засоби мультимедіа 👇

Середній бал ЗНО на бюджет у 2022 році: <i>172.23</i>
Середній бал ЗНО на контракт у 2022 році: <i>147.90</i>
--------------------------------------------------------
'''


AboutTeleFirst_engl = '''
✨172 Telecommunications and radio engineering✨
Here are the results 👇
--------------------------------------------------------
<i>Your score is №1 - priority 1
Your score is №2 - priority 2</i>
'''

AboutTeleFirst = '''
✨172 Телекомунікації та радіотехніка✨
Тримай результати 👇
--------------------------------------------------------
<i>Ваш бал №1 — 1 пріорітет 
Ваш бал №2 — 2 пріорітет</i>
'''

AboutTeleBallFirst_engl = '''
Your score is №1 — '''
AboutTeleBallFirst = '''
Ваш бал №1 — '''

AboutTeleBallSecond_engl = '''
Your score is №2 — '''
AboutTeleBallSecond = '''
Ваш бал №2 — '''


AboutTeleSecond_engl = f'''

It will be the same for all educational programmes ❗️
--------------------------------------------------------
Educational programme: Radio electronic means of embedded systems 👇

Average EIT score for the state budget in 2022 — <i>158.33</i>
Average EIT score for a contract in 2022 — <i>136.67</i>
--------------------------------------------------------
Educational programme: Information and network engineering 👇

Average EIT score for the state budget in 2022 — <i>158.19</i>
Average EIT score for a contract in 2022 — <i>139.56</i>
--------------------------------------------------------
Educational programme: Media Engineering 👇

Average EIT score for the state budget in 2022 — <i>176.56</i>
Average EIT score for a contract in 2022 — <i>145.42</i>
'''

AboutTeleSecond = f'''

Він буде однаковий для всіх освітніх програм ❗️
--------------------------------------------------------
Освітня програма: Радіоелектронні засоби вбудованих систем 👇 

Середній бал ЗНО на бюджет у 2022 році — <i>158.33</i>
Середній бал ЗНО на контракт у 2022 році — <i>136.67</i>
--------------------------------------------------------
Освітня програма: Інформаційно-мережна інженерія 👇

Середній бал ЗНО на бюджет у 2022 році — <i>158.19</i>
Середній бал ЗНО на контракт у 2022 році — <i>139.56</i>
--------------------------------------------------------
Освітня програма: Медіаінженерія 👇

Середній бал ЗНО на бюджет у 2022 році — <i>176.56</i>
Середній бал ЗНО на контракт у 2022 році — <i>145.42</i>
'''


AboutAvioFirst_engl = '''
✨173 Avionics✨
Here are the results 👇
--------------------------------------------------------
Here are the results 👇

<i>Your score is №1 - priority 1
Your score is №2 - priority 2</i>

Average EIT score for the state budget in 2022: <i>158.63</i>
Average EIT score for a contract in 2022: <i>137.83</i>

<i>Your score is №1</i> —'''

AboutAvioFirst = '''
✨173 Авіоніка✨
Тримай результати 👇
--------------------------------------------------------
Тримай результати 👇

<i>Ваш бал №1 — 1 пріорітет
Ваш бал №2 — 2 пріорітет</i>

Середній бал ЗНО на бюджет у 2022 році: <i>158.63</i>
Середній бал ЗНО на контракт у 2022 році: <i>137.83</i>

<i>Ваш бал №1</i> —'''


AboutAvioSecond_engl = '''
<i>Your score is №2</i> —'''

AboutAvioSecond = '''
<i>Ваш бал №2</i> —'''

AboutAuto = '''
✨174 Автоматизація та комп’ютерно-інтегровані технології✨
Тримай результати 👇
--------------------------------------------------------
<i>Ваш бал №1 — 1 пріорітет 
Ваш бал №2 — 2 пріорітет</i>
'''

AboutAutoBallFirst = '''
Ваш бал №1 — '''
AboutAutoBallSecond = '''
Ваш бал №2 — '''

AboutAutoSecond = f'''

Він буде однаковий для всіх освітніх програм ❗️
--------------------------------------------------------
Освітня програма: Системна інженерія 👇 

Середній бал ЗНО на бюджет у 2022 році — <i>166.27</i>
Середній бал ЗНО на контракт у 2022 році — <i>134.45</i>
--------------------------------------------------------
Освітня програма: Автоматизація та комп'ютерно-інтегровані технології 👇

Середній бал ЗНО на бюджет у 2022 році — <i>172.07</i>
Середній бал ЗНО на контракт у 2022 році — <i>140.70</i>
--------------------------------------------------------
'''

AboutMetroFirst = '''
✨175 Метрологія та інформаційно-вимірювальна техніка✨
Тримай результати 👇
--------------------------------------------------------
<i>Ваш бал №1 — 1 пріорітет 
Ваш бал №2 — 2 пріорітет</i>
'''

AboutMetroBallFirst = '''
Ваш бал №1 — '''
AboutMetroBallSecond = '''
Ваш бал №2 — '''

AboutMetroSecond = f'''

Він буде однаковий для всіх освітніх програм ❗️
--------------------------------------------------------
Освітня програма: Якість продукції, процесів та програмного забезпечення 👇 

Середній бал ЗНО на бюджет у 2022 році — <i>168.00</i>
Середній бал ЗНО на контракт у 2022 році — <i>134.30</i>
--------------------------------------------------------
Освітня програма: Інженерія оптоінформаційних та лазерних систем 👇

Середній бал ЗНО на бюджет у 2022 році — <i>146.53</i>
Середній бал ЗНО на контракт у 2022 році — <i>127.14</i>
--------------------------------------------------------
'''

AboutMicroFirst = '''
✨176 Мікро- та наносистемна техніка✨
Тримай результати 👇

<i>Ваш бал №1 — 1 пріорітет
Ваш бал №2 — 2 пріорітет</i>

Середній бал ЗНО на бюджет у 2022 році: <i>157.86</i>
Середній бал ЗНО на контракт у 2022 році: <i>136.00</i>

<i>Ваш бал №1</i> —'''

AboutMicroSecond = '''
<i>Ваш бал №2</i> —'''

AboutPolFirst = '''
✨186 Видавничо-поліграфічна справа✨
Тримай результати 👇

<i>Ваш бал №1 — 1 пріорітет
Ваш бал №2 — 2 пріорітет</i>

Середній бал ЗНО на бюджет у 2022 році: <i>178.98</i>
Середній бал ЗНО на контракт у 2022 році: <i>151.45</i>

<i>Ваш бал №1</i> —'''

AboutPolSecond = '''
<i>Ваш бал №2</i> —'''








